; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l18_p18_c18_g18_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(content-crate medicine crate13)
	(content-crate medicine crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(person-at person1 loc11)
	(person-at person2 loc2)
	(person-at person3 loc7)
	(person-at person4 loc11)
	(person-at person5 loc18)
	(person-at person6 loc18)
	(person-at person7 loc9)
	(person-at person8 loc6)
	(person-at person9 loc14)
	(person-at person10 loc1)
	(person-at person11 loc17)
	(person-at person12 loc14)
	(person-at person13 loc14)
	(person-at person14 loc9)
	(person-at person15 loc9)
	(person-at person16 loc8)
	(person-at person17 loc13)
	(person-at person18 loc18)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person9 food)
	(has-content-person person9 medicine)
	(has-content-person person13 food)
	(has-content-person person13 medicine)
	(has-content-person person14 medicine)
	(has-content-person person16 food)
	(has-content-person person17 food)
	(has-content-person person17 medicine)
	(has-content-person person18 medicine)
))
)

; plan
1. (put-crate-in-carrier crate18 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate18 depot)
   added: (crate-at-space crate18 carrier1 space4)
   goals met: 1 of 19
2. (put-crate-in-carrier crate7 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space3)
   goals met: 1 of 19
3. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 0 of 19
4. (pick-and-drop crate18 loc9 drone1 carrier1 space4 person14 medicine)
   deleted: (crate-at-space crate18 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person14 medicine)
   goals met: 1 of 19
5. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 19
6. (put-crate-in-carrier crate17 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate17 depot)
   added: (crate-at-space crate17 carrier1 space4)
   goals met: 2 of 19
7. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 1 of 19
8. (pick-and-drop crate7 loc8 drone1 carrier1 space3 person16 food)
   deleted: (crate-at-space crate7 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person16 food)
   goals met: 2 of 19
9. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 19
10. (put-crate-in-carrier crate6 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space3)
   goals met: 3 of 19
11. (put-crate-in-carrier crate16 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate16 depot)
   added: (crate-at-space crate16 carrier1 space2)
   goals met: 3 of 19
12. (move-carrier depot loc18 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   goals met: 2 of 19
13. (pick-and-drop crate16 loc18 drone1 carrier1 space2 person5 medicine)
   deleted: (crate-at-space crate16 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person5 medicine)
   goals met: 3 of 19
14. (pick-and-drop crate17 loc18 drone1 carrier1 space4 person6 medicine)
   deleted: (crate-at-space crate17 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person6 medicine)
   goals met: 4 of 19
15. (move-carrier loc18 depot drone1 carrier1)
   deleted: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 19
16. (put-crate-in-carrier crate15 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate15 depot)
   added: (crate-at-space crate15 carrier1 space4)
   goals met: 5 of 19
17. (move-carrier depot loc18 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   goals met: 4 of 19
18. (pick-and-drop crate15 loc18 drone1 carrier1 space4 person18 medicine)
   deleted: (crate-at-space crate15 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person18 medicine)
   goals met: 5 of 19
19. (move-carrier loc18 depot drone1 carrier1)
   deleted: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 19
20. (put-crate-in-carrier crate14 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate14 depot)
   added: (crate-at-space crate14 carrier1 space4)
   goals met: 6 of 19
21. (put-crate-in-carrier crate13 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate13 depot)
   added: (crate-at-space crate13 carrier1 space2)
   goals met: 6 of 19
22. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 5 of 19
23. (pick-and-drop crate13 loc14 drone1 carrier1 space2 person9 medicine)
   deleted: (crate-at-space crate13 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person9 medicine)
   goals met: 6 of 19
24. (pick-and-drop crate6 loc14 drone1 carrier1 space3 person9 food)
   deleted: (crate-at-space crate6 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person9 food)
   goals met: 7 of 19
25. (move-carrier loc14 depot drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 19
26. (put-crate-in-carrier crate5 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space3)
   goals met: 8 of 19
27. (put-crate-in-carrier crate12 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space2)
   goals met: 8 of 19
28. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 7 of 19
29. (pick-and-drop crate12 loc14 drone1 carrier1 space2 person13 medicine)
   deleted: (crate-at-space crate12 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person13 medicine)
   goals met: 8 of 19
30. (pick-and-drop crate5 loc14 drone1 carrier1 space3 person13 food)
   deleted: (crate-at-space crate5 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person13 food)
   goals met: 9 of 19
31. (move-carrier loc14 depot drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 10 of 19
32. (put-crate-in-carrier crate4 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space3)
   goals met: 10 of 19
33. (put-crate-in-carrier crate11 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space2)
   goals met: 10 of 19
34. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 9 of 19
35. (pick-and-drop crate11 loc13 drone1 carrier1 space2 person17 medicine)
   deleted: (crate-at-space crate11 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person17 medicine)
   goals met: 10 of 19
36. (pick-and-drop crate4 loc13 drone1 carrier1 space3 person17 food)
   deleted: (crate-at-space crate4 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person17 food)
   goals met: 11 of 19
37. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 12 of 19
38. (put-crate-in-carrier crate3 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space3)
   goals met: 12 of 19
39. (put-crate-in-carrier crate10 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space2)
   goals met: 12 of 19
40. (move-carrier depot loc11 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   goals met: 11 of 19
41. (pick-and-drop crate10 loc11 drone1 carrier1 space2 person1 medicine)
   deleted: (crate-at-space crate10 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person1 medicine)
   goals met: 12 of 19
42. (pick-and-drop crate3 loc11 drone1 carrier1 space3 person1 food)
   deleted: (crate-at-space crate3 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person1 food)
   goals met: 13 of 19
43. (pick-and-drop crate14 loc11 drone1 carrier1 space4 person4 medicine)
   deleted: (crate-at-space crate14 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person4 medicine)
   goals met: 14 of 19
44. (move-carrier loc11 depot drone1 carrier1)
   deleted: (drone-at drone1 loc11) (carrier-at carrier1 loc11)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 15 of 19
45. (put-crate-in-carrier crate9 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space4)
   goals met: 15 of 19
46. (put-crate-in-carrier crate2 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space3)
   goals met: 15 of 19
47. (put-crate-in-carrier crate8 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space2)
   goals met: 15 of 19
48. (move-carrier depot loc7 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   goals met: 14 of 19
49. (pick-and-drop crate8 loc7 drone1 carrier1 space2 person3 medicine)
   deleted: (crate-at-space crate8 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person3 medicine)
   goals met: 15 of 19
50. (pick-and-drop crate2 loc7 drone1 carrier1 space3 person3 food)
   deleted: (crate-at-space crate2 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person3 food)
   goals met: 16 of 19
51. (move-carrier loc7 loc2 drone1 carrier1)
   deleted: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 16 of 19
52. (pick-and-drop crate9 loc2 drone1 carrier1 space4 person2 medicine)
   deleted: (crate-at-space crate9 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person2 medicine)
   goals met: 17 of 19
53. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 18 of 19
54. (put-crate-in-carrier crate1 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space4)
   goals met: 18 of 19
55. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 17 of 19
56. (pick-and-drop crate1 loc2 drone1 carrier1 space4 person2 food)
   deleted: (crate-at-space crate1 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person2 food)
   goals met: 18 of 19
57. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 19 of 19
